HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxBmu_regdef.h
/** \\brief  Fifo Monitor Status Register */
typedef struct _Ifx_BMU_FMSTS_Bits
{
    unsigned int FHT_STS:1;                 /**< \brief [0:0] Status Flag for Fifo High Threshold interrupt (rwh) */
    unsigned int OVF_STS:1;                 /**< \brief [1:1] Status Flag for Overrun interrupt (rwh) */
    unsigned int UDF_STS:1;                 /**< \brief [2:2] Status Flag for Underflow interrupt (rwh) */
    unsigned int reserved_3:29;             /**< \brief \internal Reserved */
} Ifx_BMU_FMSTS_Bits;

/** \\brief  Fifo Monitor: Fullness Threshold Register */
typedef struct _Ifx_BMU_FMTH_Bits
{
    unsigned int FHT:8;                     /**< \brief [7:0] Fifo High Threshold (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_BMU_FMTH_Bits;

/** \\brief  Fullness Information for Bus Transaction Fifo */
typedef struct _Ifx_BMU_FULLNESS_Bits
{
    unsigned int UCELLS:9;                  /**< \brief [8:0] Number of valid (used) entries in the BTF (rh) */
    unsigned int reserved_9:7;              /**< \brief \internal Reserved */
    unsigned int FCELLS:9;                  /**< \brief [24:16] Number of free entries in the BTF (rh) */
    unsigned int reserved_25:7;             /**< \brief \internal Reserved */
} Ifx_BMU_FULLNESS_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_BMU_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_BMU_ID_Bits;

/** \\brief  Peripheral Set 0 Configuration */
typedef struct _Ifx_BMU_PSET0_Bits
{
    unsigned int FPI_SEL0:1;                /**< \brief [0:0] Select Bit for FPI Region 0 (rw) */
    unsigned int FPI_SEL1:1;                /**< \brief [1:1] Select Bit for FPI Region 1 (rw) */
    unsigned int FPI_SEL2:1;                /**< \brief [2:2] Select Bit for FPI Region 2 (rw) */
    unsigned int FPI_SEL3:1;                /**< \brief [3:3] Select Bit for FPI Region 3 (rw) */
    unsigned int FPI_SEL4:1;                /**< \brief [4:4] Select Bit for FPI Region 4 (rw) */
    unsigned int FPI_SEL5:1;                /**< \brief [5:5] Select Bit for FPI Region 5 (rw) */
    unsigned int FPI_SEL6:1;                /**< \brief [6:6] Select Bit for FPI Region 6 (rw) */
    unsigned int FPI_SEL7:1;                /**< \brief [7:7] Select Bit for FPI Region 7 (rw) */
    unsigned int FPI_SEL8:1;                /**< \brief [8:8] Select Bit for FPI Region 8 (rw) */
    unsigned int FPI_SEL9:1;                /**< \brief [9:9] Select Bit for FPI Region 9 (rw) */
    unsigned int FPI_SEL10:1;               /**< \brief [10:10] Select Bit for FPI Region 10 (rw) */
    unsigned int FPI_SEL11:1;               /**< \brief [11:11] Select Bit for FPI Region 11 (rw) */
    unsigned int FPI_SEL12:1;               /**< \brief [12:12] Select Bit for FPI Region 12 (rw) */
    unsigned int FPI_SEL13:1;               /**< \brief [13:13] Select Bit for FPI Region 13 (rw) */
    unsigned int FPI_SEL14:1;               /**< \brief [14:14] Select Bit for FPI Region 14 (rw) */
    unsigned int FPI_SEL15:1;               /**< \brief [15:15] Select Bit for FPI Region 15 (rw) */
    unsigned int FPI_SEL16:1;               /**< \brief [16:16] Select Bit for FPI Region 16 (rw) */
    unsigned int FPI_SEL17:1;               /**< \brief [17:17] Select Bit for FPI Region 17 (rw) */
    unsigned int FPI_SEL18:1;               /**< \brief [18:18] Select Bit for FPI Region 18 (rw) */
    unsigned int FPI_SEL19:1;               /**< \brief [19:19] Select Bit for FPI Region 19 (rw) */
    unsigned int FPI_SEL20:1;               /**< \brief [20:20] Select Bit for FPI Region 20 (rw) */
    unsigned int FPI_SEL21:1;               /**< \brief [21:21] Select Bit for FPI Region 21 (rw) */
    unsigned int FPI_SEL22:1;               /**< \brief [22:22] Select Bit for FPI Region 22 (rw) */
    unsigned int FPI_SEL23:1;               /**< \brief [23:23] Select Bit for FPI Region 23 (rw) */
    unsigned int FPI_SEL24:1;               /**< \brief [24:24] Select Bit for FPI Region 24 (rw) */
    unsigned int FPI_SEL25:1;               /**< \brief [25:25] Select Bit for FPI Region 25 (rw) */
    unsigned int FPI_SEL26:1;               /**< \brief [26:26] Select Bit for FPI Region 26 (rw) */
    unsigned int FPI_SEL27:1;               /**< \brief [27:27] Select Bit for FPI Region 27 (rw) */
    unsigned int FPI_SEL28:1;               /**< \brief [28:28] Select Bit for FPI Region 28 (rw) */
    unsigned int FPI_SEL29:1;               /**< \brief [29:29] Select Bit for FPI Region 29 (rw) */
    unsigned int FPI_SEL30:1;               /**< \brief [30:30] Select Bit for FPI Region 30 (rw) */
    unsigned int FPI_SEL31:1;               /**< \brief [31:31] Select Bit for FPI Region 31 (rw) */
} Ifx_BMU_PSET0_Bits;

/** \\brief  Peripheral Set 1 Configuration */
typedef struct _Ifx_BMU_PSET1_Bits
{
    unsigned int FPI_SEL32:1;               /**< \brief [0:0] Select Bit for FPI Region 32 (rw) */
    unsigned int FPI_SEL33:1;               /**< \brief [1:1] Select Bit for FPI Region 33 (rw) */
    unsigned int FPI_SEL34:1;               /**< \brief [2:2] Select Bit for FPI Region 34 (rw) */
    unsigned int FPI_SEL35:1;               /**< \brief [3:3] Select Bit for FPI Region 35 (rw) */
    unsigned int FPI_SEL36:1;               /**< \brief [4:4] Select Bit for FPI Region 36 (rw) */
    unsigned int FPI_SEL37:1;               /**< \brief [5:5] Select Bit for FPI Region 37 (rw) */
    unsigned int FPI_SEL38:1;               /**< \brief [6:6] Select Bit for FPI Region 38 (rw) */
    unsigned int FPI_SEL39:1;               /**< \brief [7:7] Select Bit for FPI Region 39 (rw) */
    unsigned int FPI_SEL40:1;               /**< \brief [8:8] Select Bit for FPI Region 40 (rw) */
    unsigned int FPI_SEL41:1;               /**< \brief [9:9] Select Bit for FPI Region 41 (rw) */
    unsigned int FPI_SEL42:1;               /**< \brief [10:10] Select Bit for FPI Region 42 (rw) */
    unsigned int FPI_SEL43:1;               /**< \brief [11:11] Select Bit for FPI Region 43 (rw) */
    unsigned int FPI_SEL44:1;               /**< \brief [12:12] Select Bit for FPI Region 44 (rw) */
    unsigned int FPI_SEL45:1;               /**< \brief [13:13] Select Bit for FPI Region 45 (rw) */
    unsigned int FPI_SEL46:1;               /**< \brief [14:14] Select Bit for FPI Region 46 (rw) */
    unsigned int FPI_SEL47:1;               /**< \brief [15:15] Select Bit for FPI Region 47 (rw) */
    unsigned int FPI_SEL48:1;               /**< \brief [16:16] Select Bit for FPI Region 48 (rw) */
    unsigned int FPI_SEL49:1;               /**< \brief [17:17] Select Bit for FPI Region 49 (rw) */
    unsigned int FPI_SEL50:1;               /**< \brief [18:18] Select Bit for FPI Region 50 (rw) */
    unsigned int FPI_SEL51:1;               /**< \brief [19:19] Select Bit for FPI Region 51 (rw) */
    unsigned int FPI_SEL52:1;               /**< \brief [20:20] Select Bit for FPI Region 52 (rw) */
    unsigned int FPI_SEL53:1;               /**< \brief [21:21] Select Bit for FPI Region 53 (rw) */
    unsigned int FPI_SEL54:1;               /**< \brief [22:22] Select Bit for FPI Region 54 (rw) */
    unsigned int FPI_SEL55:1;               /**< \brief [23:23] Select Bit for FPI Region 55 (rw) */
    unsigned int FPI_SEL56:1;               /**< \brief [24:24] Select Bit for FPI Region 56 (rw) */
    unsigned int FPI_SEL57:1;               /**< \brief [25:25] Select Bit for FPI Region 57 (rw) */
    unsigned int FPI_SEL58:1;               /**< \brief [26:26] Select Bit for FPI Region 58 (rw) */
    unsigned int FPI_SEL59:1;               /**< \brief [27:27] Select Bit for FPI Region 59 (rw) */
    unsigned int FPI_SEL60:1;               /**< \brief [28:28] Select Bit for FPI Region 60 (rw) */
    unsigned int FPI_SEL61:1;               /**< \brief [29:29] Select Bit for FPI Region 61 (rw) */
    unsigned int FPI_SEL62:1;               /**< \brief [30:30] Select Bit for FPI Region 62 (rw) */
    unsigned int FPI_SEL63:1;               /**< \brief [31:31] Select Bit for FPI Region 63 (rw) */
} Ifx_BMU_PSET1_Bits;

