HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxBmu_regdef.h
/** \\brief  Peripheral Set 2 Configuration */
typedef struct _Ifx_BMU_PSET2_Bits
{
    unsigned int FPI_SEL64:1;               /**< \brief [0:0] Select Bit for FPI Region 64 (rw) */
    unsigned int FPI_SEL65:1;               /**< \brief [1:1] Select Bit for FPI Region 65 (rw) */
    unsigned int FPI_SEL66:1;               /**< \brief [2:2] Select Bit for FPI Region 66 (rw) */
    unsigned int FPI_SEL67:1;               /**< \brief [3:3] Select Bit for FPI Region 67 (rw) */
    unsigned int FPI_SEL68:1;               /**< \brief [4:4] Select Bit for FPI Region 68 (rw) */
    unsigned int FPI_SEL69:1;               /**< \brief [5:5] Select Bit for FPI Region 69 (rw) */
    unsigned int FPI_SEL70:1;               /**< \brief [6:6] Select Bit for FPI Region 70 (rw) */
    unsigned int FPI_SEL71:1;               /**< \brief [7:7] Select Bit for FPI Region 71 (rw) */
    unsigned int FPI_SEL72:1;               /**< \brief [8:8] Select Bit for FPI Region 72 (rw) */
    unsigned int FPI_SEL73:1;               /**< \brief [9:9] Select Bit for FPI Region 73 (rw) */
    unsigned int FPI_SEL74:1;               /**< \brief [10:10] Select Bit for FPI Region 74 (rw) */
    unsigned int FPI_SEL75:1;               /**< \brief [11:11] Select Bit for FPI Region 75 (rw) */
    unsigned int FPI_SEL76:1;               /**< \brief [12:12] Select Bit for FPI Region 76 (rw) */
    unsigned int FPI_SEL77:1;               /**< \brief [13:13] Select Bit for FPI Region 77 (rw) */
    unsigned int FPI_SEL78:1;               /**< \brief [14:14] Select Bit for FPI Region 78 (rw) */
    unsigned int FPI_SEL79:1;               /**< \brief [15:15] Select Bit for FPI Region 79 (rw) */
    unsigned int FPI_SEL80:1;               /**< \brief [16:16] Select Bit for FPI Region 80 (rw) */
    unsigned int FPI_SEL81:1;               /**< \brief [17:17] Select Bit for FPI Region 81 (rw) */
    unsigned int FPI_SEL82:1;               /**< \brief [18:18] Select Bit for FPI Region 82 (rw) */
    unsigned int FPI_SEL83:1;               /**< \brief [19:19] Select Bit for FPI Region 83 (rw) */
    unsigned int FPI_SEL84:1;               /**< \brief [20:20] Select Bit for FPI Region 84 (rw) */
    unsigned int FPI_SEL85:1;               /**< \brief [21:21] Select Bit for FPI Region 85 (rw) */
    unsigned int FPI_SEL86:1;               /**< \brief [22:22] Select Bit for FPI Region 86 (rw) */
    unsigned int FPI_SEL87:1;               /**< \brief [23:23] Select Bit for FPI Region 87 (rw) */
    unsigned int FPI_SEL88:1;               /**< \brief [24:24] Select Bit for FPI Region 88 (rw) */
    unsigned int FPI_SEL89:1;               /**< \brief [25:25] Select Bit for FPI Region 89 (rw) */
    unsigned int FPI_SEL90:1;               /**< \brief [26:26] Select Bit for FPI Region 90 (rw) */
    unsigned int FPI_SEL91:1;               /**< \brief [27:27] Select Bit for FPI Region 91 (rw) */
    unsigned int FPI_SEL92:1;               /**< \brief [28:28] Select Bit for FPI Region 92 (rw) */
    unsigned int FPI_SEL93:1;               /**< \brief [29:29] Select Bit for FPI Region 93 (rw) */
    unsigned int FPI_SEL94:1;               /**< \brief [30:30] Select Bit for FPI Region 94 (rw) */
    unsigned int FPI_SEL95:1;               /**< \brief [31:31] Select Bit for FPI Region 95 (rw) */
} Ifx_BMU_PSET2_Bits;

/** \\brief  Pointer Information for Bus Transaction Fifo */
typedef struct _Ifx_BMU_PTR_Bits
{
    unsigned int RPTR:8;                    /**< \brief [7:0] Read Pointer Position (rh) */
    unsigned int reserved_8:8;              /**< \brief \internal Reserved */
    unsigned int WPTR:8;                    /**< \brief [23:16] Write Pointer Position (rh) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_BMU_PTR_Bits;

/** \\brief  FPI Transaction ID Set 0 Configuration */
typedef struct _Ifx_BMU_TID_Bits
{
    unsigned int TID0:4;                    /**< \brief [3:0] Transaction Identifier 0 (r) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_BMU_TID_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Bmu_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_BMU_ACCEN0_Bits B;
} Ifx_BMU_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_BMU_ACCEN1_Bits B;
} Ifx_BMU_ACCEN1;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_BMU_CLC_Bits B;
} Ifx_BMU_CLC;

/** \\brief  Transaction Filtering Control */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_BMU_CTL_Bits B;
} Ifx_BMU_CTL;

/** \\brief  Fifo Monitor control register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_BMU_FMCTL_Bits B;
} Ifx_BMU_FMCTL;

/** \\brief  Fifo Monitor Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_BMU_FMSTS_Bits B;
} Ifx_BMU_FMSTS;

/** \\brief  Fifo Monitor: Fullness Threshold Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_BMU_FMTH_Bits B;
} Ifx_BMU_FMTH;

/** \\brief  Fullness Information for Bus Transaction Fifo */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_BMU_FULLNESS_Bits B;
} Ifx_BMU_FULLNESS;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_BMU_ID_Bits B;
} Ifx_BMU_ID;

/** \\brief  Peripheral Set 0 Configuration */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_BMU_PSET0_Bits B;
} Ifx_BMU_PSET0;

/** \\brief  Peripheral Set 1 Configuration */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_BMU_PSET1_Bits B;
} Ifx_BMU_PSET1;

