HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxBmu_regdef.h
/** \\brief  Peripheral Set 2 Configuration */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_BMU_PSET2_Bits B;
} Ifx_BMU_PSET2;

/** \\brief  Pointer Information for Bus Transaction Fifo */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_BMU_PTR_Bits B;
} Ifx_BMU_PTR;

/** \\brief  FPI Transaction ID Set 0 Configuration */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_BMU_TID_Bits B;
} Ifx_BMU_TID;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Bmu_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  BMU object */
typedef volatile struct _Ifx_BMU
{
    Ifx_BMU_CLC CLC;                        /**< \brief 0, Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_BMU_ID ID;                          /**< \brief 8, Module Identification Register */
    unsigned char reserved_C[20];           /**< \brief C, \internal Reserved */
    Ifx_BMU_CTL CTL;                        /**< \brief 20, Transaction Filtering Control */
    Ifx_BMU_PTR PTR;                        /**< \brief 24, Pointer Information for Bus Transaction Fifo */
    Ifx_BMU_FULLNESS FULLNESS;              /**< \brief 28, Fullness Information for Bus Transaction Fifo */
    unsigned char reserved_2C[4];           /**< \brief 2C, \internal Reserved */
    Ifx_BMU_PSET0 PSET0;                    /**< \brief 30, Peripheral Set 0 Configuration */
    Ifx_BMU_PSET1 PSET1;                    /**< \brief 34, Peripheral Set 1 Configuration */
    Ifx_BMU_PSET2 PSET2;                    /**< \brief 38, Peripheral Set 2 Configuration */
    Ifx_BMU_TID TID;                        /**< \brief 3C, FPI Transaction ID Set 0 Configuration */
    Ifx_BMU_FMCTL FMCTL;                    /**< \brief 40, Fifo Monitor control register */
    Ifx_BMU_FMSTS FMSTS;                    /**< \brief 44, Fifo Monitor Status Register */
    Ifx_BMU_FMTH FMTH;                      /**< \brief 48, Fifo Monitor: Fullness Threshold Register */
    unsigned char reserved_4C[172];         /**< \brief 4C, \internal Reserved */
    Ifx_BMU_ACCEN1 ACCEN1;                  /**< \brief F8, Access Enable Register 1 */
    Ifx_BMU_ACCEN0 ACCEN0;                  /**< \brief FC, Access Enable Register 0 */
    unsigned char reserved_100[256];        /**< \brief 100, \internal Reserved */
} Ifx_BMU;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXBMU_REGDEF_H */
